[
  {
    "id": "standard-features",
    "name": "standard-features",
    "description": "Comprehensive checklist for web and mobile app quality — authentication, navigation, forms, accessibility, responsive design, and mobile debugging. Use for any app build, code review, or audit to ensure ≥90% feature coverage and WCAG 2.1 AA compliance. Includes Eruda mobile console, footer, hamburge",
    "type": "development",
    "source": "workspace",
    "usageCount": 128
  },
  {
    "id": "modern-design",
    "name": "modern-design",
    "description": "Modern web design system for 2026 - glassmorphism, gradients, animations, and accessibility. Apply unique themes to each app while maintaining consistency.",
    "type": "design",
    "source": "workspace",
    "usageCount": 124
  },
  {
    "id": "location-places",
    "name": "location-places",
    "description": "Guidelines for providing location information with complete details including Google Maps links, ratings, hours, and distances. Always include Maps links for any place mentioned. Integrates with places-search (goplaces + spots) skills. Trigger words: restaurant location, place details, google maps l",
    "type": "search",
    "source": "workspace",
    "usageCount": 117
  },
  {
    "id": "cloudflare-pages-deploy",
    "name": "cloudflare-pages-deploy",
    "description": "Deploy static sites to Cloudflare Pages. Three fallback methods - API trigger, git push, wrangler CLI. NEVER say \"can't deploy\" until all 3 methods fail.",
    "type": "deployment",
    "source": "workspace",
    "usageCount": 115
  },
  {
    "id": "no-bs-debugging",
    "name": "no-bs-debugging",
    "description": "Stop making excuses. Fix it properly. Test like the user. Prove it works. MANDATORY: Test with Playwright BEFORE deploying any new feature. No excuses. No \"works on my machine.\" Test it. Prove it. Then deploy.",
    "type": "development",
    "source": "workspace",
    "usageCount": 112
  },
  {
    "id": "travel-restaurants",
    "name": "travel-restaurants",
    "description": "Find restaurants and dining locations using Google Places API with comprehensive data — ratings, hours, phone numbers, and precise locations. Use when searching for restaurants during travel or trip planning. Trigger words: travel restaurants, restaurant search, find restaurants, dining, Google Plac",
    "type": "lifestyle",
    "source": "workspace",
    "usageCount": 110
  },
  {
    "id": "phone-calls-bland",
    "name": "phone-calls",
    "description": "Make AI-powered phone calls via Bland AI - book restaurants, make appointments, inquire about services. The AI calls on your behalf and reports back with transcripts.",
    "type": "communication",
    "source": "workspace",
    "usageCount": 105
  },
  {
    "id": "intel-monitor",
    "name": "intel-monitor",
    "description": "Continuous surveillance on configured X accounts and keywords. Runs on",
    "type": "utility",
    "source": "workspace",
    "usageCount": 102
  },
  {
    "id": "memory-optimization",
    "name": "memory-optimization",
    "description": "Consolidate, optimize, and deduplicate all memory systems — Supermemory, mem0, MEMORY.md, and daily files — so they work together efficiently. Removes duplicates, fixes contradictions, and improves searchability. Trigger words: optimize memory, consolidate memory, memory cleanup, deduplicate, clean ",
    "type": "memory",
    "source": "workspace",
    "usageCount": 94
  },
  {
    "id": "coding-agent",
    "name": "coding-agent",
    "description": "Delegate coding tasks to Codex, Claude Code, or Pi agents via background process. Use when: (1) building/creating new features or apps, (2) reviewing PRs (spawn in temp dir), (3) refactoring large codebases, (4) iterative coding that needs file exploration. NOT for: simple one-liner fixes (just edit",
    "type": "agent",
    "source": "openclaw",
    "usageCount": 83
  },
  {
    "id": "clawhub",
    "name": "clawhub",
    "description": "Use the ClawHub CLI to search, install, update, and publish agent skills from clawhub.com. Use when you need to fetch new skills on the fly, sync installed skills to latest or a specific version, or publish new/updated skill folders with the npm-installed clawhub CLI.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 76
  },
  {
    "id": "places-search",
    "name": "places-search",
    "description": "Comprehensive location search combining goplaces (fast Google Places API queries) with spots (exhaustive grid-based scanning for hidden gems). Use when searching for restaurants, cafes, attractions, or any places near a location. Requires Google Places API key. Trigger words: find restaurant, places",
    "type": "search",
    "source": "workspace",
    "usageCount": 72
  },
  {
    "id": "weather",
    "name": "weather",
    "description": "Get current weather and forecasts via wttr.in or Open-Meteo. Use when: user asks about weather, temperature, or forecasts for any location. NOT for: historical weather data, severe weather alerts, or detailed meteorological analysis. No API key needed.",
    "type": "lifestyle",
    "source": "openclaw",
    "usageCount": 66
  },
  {
    "id": "email-daily-summary",
    "name": "email-daily-summary",
    "description": "Automatically logs into email accounts (Gmail, Outlook, QQ Mail, etc.) and generates daily email summaries. Use when the user wants to get a summary of their emails, check important messages, or create daily email digests.",
    "type": "communication",
    "source": "workspace",
    "usageCount": 65
  },
  {
    "id": "security-sentinel",
    "name": "security-sentinel",
    "description": "Scan the workspace for security vulnerabilities, exposed secrets, and misconfigurations.",
    "type": "security",
    "source": "workspace",
    "usageCount": 65
  },
  {
    "id": "markdown-optimization",
    "name": "markdown-optimization",
    "description": "Daily monitoring and correction of workspace documentation to prevent repeat mistakes caused by incorrect or outdated markdown files. Detects conflicting docs, outdated deployment instructions, and bad Supermemory entries. Trigger words: fix docs, outdated documentation, repeat mistakes, audit docs,",
    "type": "development",
    "source": "workspace",
    "usageCount": 64
  },
  {
    "id": "telegram-screenshot-delivery",
    "name": "telegram-screenshot-delivery",
    "description": "Reliably deliver screenshots to Telegram using correct path format. Supports ImageMagick, Playwright, and Percy integration. Use when sending screenshots, mockups, or visual proof to Telegram. Trigger words: telegram screenshot, send image to telegram, telegram delivery, screenshot to telegram, tele",
    "type": "communication",
    "source": "workspace",
    "usageCount": 64
  },
  {
    "id": "tiktok-teneo",
    "name": "tiktok-teneo",
    "description": "The agent gives you the ability to extract data from tiktok through different commands.",
    "type": "social",
    "source": "workspace",
    "usageCount": 63
  },
  {
    "id": "vibe-coding-patterns",
    "name": "vibe-coding-patterns",
    "description": "Production-ready coding standards, security checklists, and hostile audit prompts. Use when starting new projects, reviewing code pre-commit, auditing security, or ensuring production readiness. Triggers on mentions of security audit, code review, production ready, best practices, hostile audit.",
    "type": "agent",
    "source": "workspace",
    "usageCount": 60
  },
  {
    "id": "clawhub-security",
    "name": "clawhub-security",
    "description": "Security check for ClawHub skills using Clawdex API before installation. ALWAYS scan with Clawdex before installing any ClawHub skill. Blocks malicious skills, warns on unknown ones. Trigger words: install skill, clawhub install, skill security, clawdex scan, safe install.",
    "type": "security",
    "source": "workspace",
    "usageCount": 57
  },
  {
    "id": "coder-agent",
    "name": "coder-agent",
    "description": "Spawn and manage autonomous coding agents via sessions_spawn. Inherits capabilities from deprecated tmux workflows: task discovery, error detection, quality gates, 3-platform testing, and result logging. Use for autonomous coding, overnight builds, and any background development work.",
    "type": "agent",
    "source": "workspace",
    "usageCount": 55
  },
  {
    "id": "flight-search",
    "name": "flight-search",
    "description": "Search Google Flights for prices, times, and airlines. No API key required.",
    "type": "search",
    "source": "workspace",
    "usageCount": 55
  },
  {
    "id": "yt-dlp-downloader-skill",
    "name": "yt-dlp-downloader",
    "description": "Download videos from YouTube, Bilibili, Twitter, and thousands of other sites using yt-dlp. Use when the user provides a video URL and wants to download it, extract audio (MP3), download subtitles, or select video quality. Triggers on phrases like \"下载视频\", \"download video\", \"yt-dlp\", \"YouTube\", \"B站\",",
    "type": "media",
    "source": "workspace",
    "usageCount": 55
  },
  {
    "id": "airbnb-search",
    "name": "airbnb-search",
    "description": "Search Airbnb listings with prices, ratings, and direct links. No API key required.",
    "type": "search",
    "source": "workspace",
    "usageCount": 54
  },
  {
    "id": "scholarship-research",
    "name": "scholarship-research",
    "description": "Research scholarships for students pursuing accounting, finance, or business degrees. Use when asked to find scholarships, research financial aid, identify scholarship opportunities, or create scholarship lists. Enforces strict criteria - no duplicates, direct application links only (not aggregators",
    "type": "search",
    "source": "workspace",
    "usageCount": 54
  },
  {
    "id": "calendar",
    "name": "calendar",
    "description": "Calendar management and scheduling. Create events, manage meetings, and sync across calendar providers.",
    "type": "communication",
    "source": "workspace",
    "usageCount": 53
  },
  {
    "id": "places-lookup",
    "name": "places-lookup",
    "description": "Universal place search for ANY type of location — grocery stores, gas stations, restaurants, pharmacies, parks, attractions, coffee shops, salons, anything. Always includes Google Maps driving directions links. Uses Google Places API (New) as primary source with optional TripAdvisor enrichment for r",
    "type": "search",
    "source": "workspace",
    "usageCount": 53
  },
  {
    "id": "travel-concierge",
    "name": "travel-concierge",
    "description": "Find contact details for accommodation listings (Airbnb, Booking.com, VRBO, Expedia)",
    "type": "lifestyle",
    "source": "workspace",
    "usageCount": 53
  },
  {
    "id": "uptime-monitor",
    "name": "uptime-monitor",
    "description": "24/7 OpenClaw uptime monitor. Every 5min cron ping → writes dead.json if down, uptime.json after 7d (168h) continuous alive streak. Use when setting up persistent monitoring (cron setup, streak tracking, status files).",
    "type": "utility",
    "source": "workspace",
    "usageCount": 53
  },
  {
    "id": "ralph-loop-agent",
    "name": "ralph-loop",
    "description": "Guide OpenClaw agents to execute Ralph Wiggum loops using sessions_spawn or exec/process tools. Agent orchestrates coding agents (Codex, OpenCode, Goose) with proper TTY support. Plans/builds code via PROMPT.md + AGENTS.md, SPECS and IMPLEMENTATION_PLAN.md. Includes PLANNING vs BUILDING modes, backp",
    "type": "agent",
    "source": "workspace",
    "usageCount": 51
  },
  {
    "id": "goplaces",
    "name": "goplaces",
    "description": "Query Google Places API (New) via the goplaces CLI for text search, place details, resolve, and reviews. Use for human-friendly place lookup or JSON output for scripts.",
    "type": "search",
    "source": "workspace",
    "usageCount": 50
  },
  {
    "id": "spots",
    "name": "spots",
    "description": "Exhaustive Google Places search using grid-based scanning. Finds ALL places, not just what Google surfaces.",
    "type": "search",
    "source": "workspace",
    "usageCount": 44
  },
  {
    "id": "metricool",
    "name": "metricool",
    "description": "Schedule and manage social media posts via Metricool API. Use when posting to multiple platforms (LinkedIn, X, Bluesky, Threads, Instagram), checking scheduled posts, or analyzing social metrics.",
    "type": "social",
    "source": "workspace",
    "usageCount": 43
  },
  {
    "id": "secret-keys",
    "name": "secret-keys",
    "description": "Secure handling of API keys, secrets, and credentials. Never expose keys in chat — store in keys.env, reference by variable name only. Covers storage, rotation, Supabase cloud sync, and git hygiene. Trigger words: API key, secret, credentials, keys.env, token, bearer token, secret management, key ro",
    "type": "utility",
    "source": "workspace",
    "usageCount": 39
  },
  {
    "id": "memory-management",
    "name": "memory-management",
    "description": "Systematic memory storage, retrieval, and optimization across all memory systems — daily logs, MEMORY.md, structured decision/pattern files, Supermemory, and mem0. Use to remember important info, search past decisions, and maintain continuity across sessions. Trigger words: remember, memory, recall,",
    "type": "memory",
    "source": "workspace",
    "usageCount": 36
  },
  {
    "id": "places-api-recommendations",
    "name": "places-api-recommendations",
    "description": "MANDATORY method for all restaurant, cafe, and place recommendations. Always use Google Places API (New) - never web scraping or Brave Search. Brian's directive: \"make it a commandment across all applications.\"",
    "type": "search",
    "source": "workspace",
    "usageCount": 36
  },
  {
    "id": "tripadvisor",
    "name": "tripadvisor",
    "description": "TripAdvisor Content API v1 for restaurant search, details, reviews, ratings, and photos. Integrates with Google Places for comprehensive recommendations. Use when getting TripAdvisor data for restaurants, hotels, or attractions. Trigger words: TripAdvisor, restaurant reviews, TA ratings, TripAdvisor",
    "type": "lifestyle",
    "source": "workspace",
    "usageCount": 35
  },
  {
    "id": "x-post-automation",
    "name": "x-automation",
    "description": "Automates the process of identifying trends on X (Twitter), generating opinionated/engaging content, and posting it. Use when asked to post to X, run X automation, or check trends for content creation. Includes automated hourly monitoring of breaking news sources (@ProjectConstitu, @RealCandaceO, @B",
    "type": "social",
    "source": "workspace",
    "usageCount": 31
  },
  {
    "id": "restaurant-lookup",
    "name": "restaurant-lookup",
    "description": "Comprehensive restaurant search and recommendation system combining Google Places API (primary), TripAdvisor Content API v1 (reviews/ratings/photos), and SerpApi Google Images (food photos). For international locations, automatically enriches results with full TripAdvisor details, reviews, photos, a",
    "type": "lifestyle",
    "source": "workspace",
    "usageCount": 29
  },
  {
    "id": "openclaw-release-monitor",
    "name": "openclaw-release-monitor",
    "description": "Monitor OpenClaw releases and updates via GitHub API. Checks for new versions, reports what changed, and triggers update workflow. Trigger words: openclaw update, new version, openclaw release, check for updates, openclaw monitor.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 27
  },
  {
    "id": "tmux",
    "name": "tmux",
    "description": "Remote-control tmux sessions for interactive CLIs by sending keystrokes and scraping pane output.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 27
  },
  {
    "id": "autonomous-work",
    "name": "autonomous-work",
    "description": "Autonomous overnight work system using Ralph Loop and sessions_spawn. Enables coding work while you sleep — tasks are picked from ACTIVE queue, executed via sessions_spawn, monitored until complete, and results logged. Trigger words: overnight work, autonomous, ralph loop, background coding, work wh",
    "type": "agent",
    "source": "workspace",
    "usageCount": 26
  },
  {
    "id": "deployment-proof",
    "name": "deployment-proof",
    "description": "MANDATORY deployment workflow with Percy visual testing and Playwright screenshots. NEVER claim \"deployed\" or \"fixed\" without following this exact workflow. Enforced via Commandment #36.",
    "type": "deployment",
    "source": "workspace",
    "usageCount": 26
  },
  {
    "id": "screenshot-proof-workflow",
    "name": "screenshot-proof-workflow",
    "description": "Mandatory workflow for delivering screenshot proof to Telegram before claiming any fix is \"deployed\" or \"working\". Enforced after multiple violations where agents claimed fixes worked without screenshots, and bugs were still present. Use when: reporting test results, deployment verifications, bug fi",
    "type": "testing",
    "source": "workspace",
    "usageCount": 24
  },
  {
    "id": "pentest",
    "name": "security-reviewer",
    "description": "Use when conducting security audits, reviewing code for vulnerabilities, or analyzing infrastructure security. Invoke for SAST scans, penetration testing, DevSecOps practices, cloud security reviews.",
    "type": "security",
    "source": "workspace",
    "usageCount": 23
  },
  {
    "id": "batch-memory-save",
    "name": "batch-memory-save",
    "description": "Save learnings and config changes to ALL memory systems at once. Prevents knowledge loss and repeated mistakes by ensuring consistency across Supermemory, mem0, daily files, COMMANDMENTS.md, and TOOLS.md. Trigger words: save everywhere, batch save, save learnings, remember this everywhere, sync memo",
    "type": "memory",
    "source": "workspace",
    "usageCount": 22
  },
  {
    "id": "screenshot-fallback",
    "name": "screenshot-fallback",
    "description": "Screenshot capability with Percy (primary) and Playwright (secondary) fallback. Use when visual proof of deployment or UI state is needed. Percy for visual regression, Playwright for direct screenshots. Trigger words: screenshot, percy screenshot, playwright screenshot, visual proof, screenshot fall",
    "type": "testing",
    "source": "workspace",
    "usageCount": 22
  },
  {
    "id": "supermemory-integration",
    "name": "supermemory-integration",
    "description": "Integration with Supermemory.ai cloud-based semantic memory storage. Store decisions, learnings, and project context that survives agent restarts. Semantic search, tagging, spaces, and API access. Use when storing long-term memories, decisions, or project context. Trigger words: Supermemory, semanti",
    "type": "memory",
    "source": "workspace",
    "usageCount": 22
  },
  {
    "id": "tiktok-browser-scanner",
    "name": "tiktok-browser-scanner",
    "description": "Scan TikTok for TPUSA critic videos using browser automation, extract URLs for reposting to X. Finds videos from Erica Kirk, Tyler Bowyer, Charlie Kirk critics. Use when searching TikTok for political content to repost. Trigger words: TikTok scanner, find TikTok videos, TikTok browser, scan TikTok, ",
    "type": "social",
    "source": "workspace",
    "usageCount": 22
  },
  {
    "id": "hostile-audit",
    "name": "hostile-audit",
    "description": "Systematic hostile code review methodology to catch production bugs, security issues, and authority leakage before deployment. 8 audit types covering database, API, read/write paths, UI, mobile, production readiness, scalability, and systems. Use when reviewing code, preparing for production, securi",
    "type": "security",
    "source": "workspace",
    "usageCount": 21
  },
  {
    "id": "google-analytics",
    "name": "google-analytics",
    "description": "Google Analytics API integration with managed OAuth. Manage accounts, properties, and data streams (Admin API). Run reports on sessions, users, page views, and conversions (Data API). Use this skill when users want to configure or query Google Analytics. For other third party apps, use the api-gatew",
    "type": "utility",
    "source": "workspace",
    "usageCount": 20
  },
  {
    "id": "telegram-screenshots",
    "name": "telegram-screenshots",
    "description": "Send visual screenshots directly in Telegram chat using the message tool with filePath. Covers 5 approaches including ImageMagick convert, Playwright, and media upload. Use when user asks for screenshots or visual output in Telegram. Trigger words: telegram screenshots, send image telegram, telegram",
    "type": "communication",
    "source": "workspace",
    "usageCount": 20
  },
  {
    "id": "scholarship-browser-agent",
    "name": "scholarship-browser-agent",
    "description": "Browser automation for scholarship research — navigates scholarship portals, verifies eligibility criteria, extracts deadlines, confirms no-fee status, and takes screenshots. Use when finding scholarships for students (especially accounting/finance). Trigger words: scholarship, scholarship search, f",
    "type": "agent",
    "source": "workspace",
    "usageCount": 19
  },
  {
    "id": "security-audit",
    "name": "security-audit",
    "description": "Hostile security audit methodology for security-sensitive code changes. 8 audit types covering database, API, read/write paths, UI, mobile, production readiness, scalability, and systems (always required). Use when reviewing encryption, authentication, payments, admin features, or file uploads. Trig",
    "type": "security",
    "source": "workspace",
    "usageCount": 19
  },
  {
    "id": "clean-blue-design",
    "name": "clean-blue-design",
    "description": "Professional clean design system built around solid blue (#2563eb). Mobile-first, minimal, highly readable. Use when building web UIs, dashboards, or apps that need a clean modern look. Trigger words: clean design, blue design system, UI design, dashboard UI, mobile-first, design system, CSS compone",
    "type": "design",
    "source": "workspace",
    "usageCount": 18
  },
  {
    "id": "second-brain",
    "name": "second-brain",
    "description": "Active intelligence layer that auto-captures tasks and decisions from conversations, cross-context searches all memory systems, and flows tasks to the kanban board. Proactively listens and captures ideas without being asked. Trigger words: second brain, capture idea, remember task, auto-capture, cro",
    "type": "utility",
    "source": "workspace",
    "usageCount": 18
  },
  {
    "id": "senior-devops",
    "name": "senior-devops",
    "description": "Comprehensive DevOps skill for CI/CD, infrastructure automation, containerization, and cloud platforms (AWS, GCP, Azure). Includes pipeline setup, infrastructure as code, deployment automation, and monitoring. Use when setting up pipelines, deploying applications, managing infrastructure, implementi",
    "type": "deployment",
    "source": "workspace",
    "usageCount": 18
  },
  {
    "id": "x-browser-monitor",
    "name": "x-browser-monitor",
    "description": "Monitor @swordtruth X account via browser automation for notifications, mentions, and TikTok content links. Use when checking X/Twitter notifications, finding TikTok links, or verifying engagement. Trigger words: X monitor, Twitter monitor, @swordtruth, X notifications, monitor mentions, check X.",
    "type": "social",
    "source": "workspace",
    "usageCount": 18
  },
  {
    "id": "last30days",
    "name": "last30days",
    "description": "Research a topic from the last 30 days on Reddit + X + Web, become an expert, and write copy-paste-ready prompts for the user's target tool.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 17
  },
  {
    "id": "ralph-loop-patterns",
    "name": "ralph-loop-patterns",
    "description": "Patterns for autonomous multi-agent development loops (Ralph Loop). Orchestrates PM → Designer → Test Writer → Coder → Validator cycles that run unattended until complete. Use for overnight builds, autonomous agent pipelines, and iterative development. Trigger words: ralph loop, autonomous agent, mu",
    "type": "agent",
    "source": "workspace",
    "usageCount": 17
  },
  {
    "id": "morning-brief",
    "name": "morning-brief",
    "description": "Automated daily morning briefing delivered via Telegram. Pulls weather",
    "type": "utility",
    "source": "workspace",
    "usageCount": 16
  },
  {
    "id": "secret-vault",
    "name": "secret-vault",
    "description": "- Rotating API tokens/keys",
    "type": "utility",
    "source": "workspace",
    "usageCount": 15
  },
  {
    "id": "batch-memory-update",
    "name": "batch-memory-update",
    "description": "Comprehensive batch memory update that saves learnings and config changes everywhere — mem0, Supermemory, workspace files, AGENTS.md, MEMORY.md, and runs audit/optimization scripts. Deletes contradictory memories to prevent repeat mistakes. Trigger words: batch update, save everywhere, full memory s",
    "type": "memory",
    "source": "workspace",
    "usageCount": 14
  },
  {
    "id": "implementation-patterns",
    "name": "implementation-patterns",
    "description": "Comprehensive implementation guidelines for quality code — subagent-driven development, TypeScript standards, state management, API integration, performance, accessibility, testing, and error handling. Use when implementing new features, doing code reviews, or setting up projects. Trigger words: imp",
    "type": "development",
    "source": "workspace",
    "usageCount": 14
  },
  {
    "id": "telegram-config",
    "name": "telegram-config",
    "description": "Configure OpenClaw Telegram bot access control — group allowlists, sender filtering, mention behavior, and DM policies. Use when setting up Telegram groups, fixing \"group not allowed\" errors, troubleshooting bot visibility, or managing who can trigger the bot in groups vs DMs.",
    "type": "communication",
    "source": "workspace",
    "usageCount": 14
  },
  {
    "id": "safe-diagnostics",
    "name": "safe-diagnostics",
    "description": "Debug config and API issues WITHOUT exposing credentials in chat. Use safe patterns to check API keys, verify configs, and diagnose problems without leaking secrets. Trigger words: debug API, check key, diagnose config, API not working, credentials safe, debug without exposing, safe debug.",
    "type": "security",
    "source": "workspace",
    "usageCount": 12
  },
  {
    "id": "vercel-deploy",
    "name": "vercel-deploy",
    "description": "Deploy and manage Vercel projects. Use when deploying applications to Vercel, managing environment variables, checking deployment status, viewing logs, or performing Vercel operations. Supports production and preview deployments. Practical infrastructure operations - no \"AI will build your app\" magi",
    "type": "deployment",
    "source": "workspace",
    "usageCount": 12
  },
  {
    "id": "expo-mobile-app",
    "name": "expo-mobile-app",
    "description": "Build production-ready React Native mobile apps with Expo that actually work in Expo Go. Based on bolt.new patterns that succeed where manual approaches fail.",
    "type": "development",
    "source": "workspace",
    "usageCount": 11
  },
  {
    "id": "github",
    "name": "github",
    "description": "GitHub operations via `gh` CLI: issues, PRs, CI runs, code review, API queries. Use when: (1) checking PR status or CI, (2) creating/commenting on issues, (3) listing/filtering PRs or issues, (4) viewing run logs. NOT for: complex web UI interactions requiring manual browser flows (use browser tooli",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 10
  },
  {
    "id": "serpapi",
    "name": "serpapi",
    "description": "Unified search API across Google, Amazon, Yelp, OpenTable, Walmart, and more. Use when searching for products, local businesses, restaurants, shopping, images, news, or any web search. One API key, many engines.",
    "type": "search",
    "source": "workspace",
    "usageCount": 10
  },
  {
    "id": "mobile-web-debugging",
    "name": "mobile-web-debugging",
    "description": "- User reports \"navigation not working\" on mobile",
    "type": "utility",
    "source": "workspace",
    "usageCount": 9
  },
  {
    "id": "tripadvisor-api",
    "name": "tripadvisor-api",
    "description": "Interact with TripAdvisor Content API v1 to search locations, retrieve details, and fetch user reviews. Use when: (1) Getting TripAdvisor-specific ratings and review counts, (2) Searching for restaurants, hotels, or attractions on TripAdvisor, (3) Enhancing restaurant data with TripAdvisor reviews, ",
    "type": "lifestyle",
    "source": "workspace",
    "usageCount": 9
  },
  {
    "id": "atl-mobile",
    "name": "atl-browser",
    "description": "Mobile browser and native app automation via ATL (iOS Simulator). Navigate, click, screenshot, and automate web and native app tasks on iPhone/iPad simulators.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 8
  },
  {
    "id": "desktop-control",
    "name": "desktop-control",
    "description": "Advanced desktop automation with mouse, keyboard, and screen control",
    "type": "utility",
    "source": "workspace",
    "usageCount": 8
  },
  {
    "id": "supabase-secrets-sync",
    "name": "supabase-secrets-sync",
    "description": "Sync secrets from Supabase vault to local keys.env file. Use this skill when you need to transfer API keys, credentials, or sensitive configuration from a Supabase-backed secrets vault and merge them into the local keys.env file.",
    "type": "database",
    "source": "workspace",
    "usageCount": 8
  },
  {
    "id": "zero-trust",
    "name": "zero-trust",
    "description": "Security-first behavioral guidelines for cautious agent operation. Use this skill for ALL operations involving external resources, installations, credentials, or actions with external effects. Triggers on - any URL/link interaction, package installations, API key handling, sending emails/messages, s",
    "type": "security",
    "source": "workspace",
    "usageCount": 8
  },
  {
    "id": "reaction-trigger",
    "name": "reaction-trigger",
    "description": "Routes Telegram emoji reactions on intel-monitor alerts into the SwordTruth",
    "type": "development",
    "source": "workspace",
    "usageCount": 7
  },
  {
    "id": "screenshot-delivery",
    "name": "screenshot-delivery",
    "description": "Generate and deliver screenshots and mockups via ImageMagick and Playwright to Telegram. Use when user asks for screenshots, UI previews, or visual mockups. ImageMagick for design mockups, Playwright for live web screenshots. Trigger words: take screenshot, send screenshot, show me, visual preview, ",
    "type": "testing",
    "source": "workspace",
    "usageCount": 7
  },
  {
    "id": "accessibility-toolkit",
    "name": "accessibility-toolkit",
    "description": "Friction-reduction patterns for agents helping humans with disabilities. Voice-first workflows, smart home templates, efficiency automation.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 6
  },
  {
    "id": "analytics-tracking",
    "name": "analytics-tracking",
    "description": "When the user wants to set up, improve, or audit analytics tracking and measurement. Also use when the user mentions \"set up tracking,\" \"GA4,\" \"Google Analytics,\" \"conversion tracking,\" \"event tracking,\" \"UTM parameters,\" \"tag manager,\" \"GTM,\" \"analytics implementation,\" or \"tracking plan.\" For A/B ",
    "type": "utility",
    "source": "workspace",
    "usageCount": 6
  },
  {
    "id": "seo-competitor-analysis",
    "name": "seo-competitor-analysis",
    "description": "Perform deep SEO competitor analysis, including keyword research, backlink checking, and content strategy mapping. Use when the user wants to analyze a website's competitors or improve their own SEO ranking by studying the competition.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 6
  },
  {
    "id": "bird",
    "name": "bird",
    "description": "X/Twitter CLI for reading, searching, and posting via cookies or Sweetistics.",
    "type": "social",
    "source": "workspace",
    "usageCount": 5
  },
  {
    "id": "percy-visual-testing",
    "name": "percy-visual-testing",
    "description": "Visual regression testing using Percy and Playwright. Take screenshots of deployed sites and compare against baselines. Required for deployment verification. Trigger words: percy, visual test, screenshot test, visual regression, deployment screenshot, percy snapshot, visual diff.",
    "type": "testing",
    "source": "workspace",
    "usageCount": 5
  },
  {
    "id": "skill-creator-2",
    "name": "skill-creator",
    "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 5
  },
  {
    "id": "supadata-transcript",
    "name": "supadata-transcript",
    "description": "Extract transcripts and metadata from YouTube, TikTok, Instagram, Twitter/X, and Facebook using Supadata API. Supports native subtitles, AI generation, and multiple output formats. Use when you need to extract video transcripts or post content. Trigger words: transcript, extract video, YouTube trans",
    "type": "media",
    "source": "workspace",
    "usageCount": 5
  },
  {
    "id": "x-api",
    "name": "x-api",
    "description": "Post to X (Twitter) using the official API with OAuth 1.0a. Use when you need to tweet, post updates, or publish content. Bypasses rate limits and bot detection that affect cookie-based approaches like bird CLI.",
    "type": "social",
    "source": "workspace",
    "usageCount": 5
  },
  {
    "id": "deploy-agent",
    "name": "deploy-agent",
    "description": "Multi-step deployment agent for full-stack apps. Build → Test → GitHub → Cloudflare Pages with human approval at each step.",
    "type": "deployment",
    "source": "workspace",
    "usageCount": 4
  },
  {
    "id": "kanban-task",
    "name": "kanban-task",
    "description": "Create, manage, move, and complete tasks on the Python Kanban Board with visual proof. Full task lifecycle — from creation to Done column with screenshot verification. Trigger words: kanban task, create task, user story, US-XXX, task management, move task, complete task, kanban board.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 4
  },
  {
    "id": "smart-memory",
    "name": "smart-memory",
    "description": "Unified memory interface for storing, searching, and retrieving information across all memory systems (mem0, Supermemory, daily files). Deduplicates and provides a single command interface. Trigger words: smart memory, store memory, search memory, remember, recall, unified memory, memory store.",
    "type": "memory",
    "source": "workspace",
    "usageCount": 4
  },
  {
    "id": "cost-model-optimization",
    "name": "cost-model-optimization",
    "description": "Identify and fix costly model misconfigurations in cron jobs and sessions. Optimize model selection to reduce token burn — use minimax for routine tasks, sonnet for coding, opus for complex reasoning. Trigger words: model cost, expensive crons, optimize models, token burn, cron model, budget optimiz",
    "type": "utility",
    "source": "workspace",
    "usageCount": 3
  },
  {
    "id": "humanizer",
    "name": "humanizer",
    "description": "Remove signs of AI-generated writing from text. Use when editing or reviewing text to make it sound more natural and human-written. Based on Wikipedia's comprehensive \"Signs of AI writing\" guide. Detects and fixes patterns including: inflated symbolism, promotional language, superficial -ing analyse",
    "type": "utility",
    "source": "workspace",
    "usageCount": 3
  },
  {
    "id": "react-expert",
    "name": "react-expert",
    "description": "Use when building React 18+ applications requiring component architecture, hooks patterns, or state management. Invoke for Server Components, performance optimization, Suspense boundaries, React 19 features.",
    "type": "development",
    "source": "workspace",
    "usageCount": 3
  },
  {
    "id": "testing-agent",
    "name": "testing-agent",
    "description": "The Testing Agent automatically generates comprehensive UX test cases for features, ensuring consistent test coverage across all projects with minimal manual effort.",
    "type": "agent",
    "source": "workspace",
    "usageCount": 3
  },
  {
    "id": "agent-task-chunking",
    "name": "agent-task-chunking",
    "description": "Break large tasks into focused chunks for sub-agents to prevent context overflow. Use when spawning coding agents, designers, or test writers. Trigger words: agent task, spawn agent, context overflow, chunk task, break down task, subagent, sessions_spawn, task too large.",
    "type": "agent",
    "source": "workspace",
    "usageCount": 2
  },
  {
    "id": "android-adb",
    "name": "android-automation",
    "description": "Control Android devices via ADB with support for UI layout analysis (uiautomator) and visual feedback (screencap). Use when you need to interact with Android apps, perform UI automation, take screenshots, or run complex ADB command sequences.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 2
  },
  {
    "id": "canvas",
    "name": "canvas",
    "description": "Display HTML content on connected OpenClaw nodes (Mac app, iOS, Android).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 2
  },
  {
    "id": "file-editing",
    "name": "file-editing",
    "description": "Reliable file editing patterns for OpenClaw. Use the read-then-edit workflow to ensure exact matches. Covers when to use edit vs write vs exec (sed). Trigger words: edit file, modify file, update file, file change, replace text, safe edit.",
    "type": "development",
    "source": "workspace",
    "usageCount": 2
  },
  {
    "id": "notion",
    "name": "notion",
    "description": "Notion API for creating and managing pages, databases, and blocks.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 2
  },
  {
    "id": "playwright-screenshots",
    "name": "playwright-screenshots",
    "description": "Capture visual screenshots of web apps using Playwright and send to Telegram. Use when user asks for screenshots, visual proof, or \"show me what it looks like\". Supports desktop and mobile viewports. Trigger words: screenshot, take screenshot, show me, visual proof, playwright screenshot, capture sc",
    "type": "testing",
    "source": "workspace",
    "usageCount": 2
  },
  {
    "id": "postgres",
    "name": "postgres",
    "description": "PostgreSQL database management. Run queries, manage schemas, and monitor performance.",
    "type": "database",
    "source": "workspace",
    "usageCount": 2
  },
  {
    "id": "skill-creator",
    "name": "skill-creator",
    "description": "Create or update AgentSkills. Use when designing, structuring, or packaging skills with scripts, references, and assets.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 2
  },
  {
    "id": "agent-orchestrator",
    "name": "agent-orchestrator",
    "description": "Meta-agent skill for orchestrating complex tasks through autonomous sub-agents. Decomposes macro tasks into subtasks, spawns specialized sub-agents with dynamically generated SKILL.md files, coordinates file-based communication, consolidates results, and dissolves agents upon completion.",
    "type": "agent",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "ai-phone",
    "name": "ai-phone",
    "description": "Make AI phone calls using Bland AI for restaurant reservations, appointments, and business inquiries. Use when you need to call a restaurant or business to make a reservation. Trigger words: make a call, phone call, reservation call, call restaurant, Bland AI, AI phone, dial, book by phone.",
    "type": "communication",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "api-spec-parser",
    "name": "api-spec-parser",
    "description": "- Building a new OpenClaw skill that wraps a REST API",
    "type": "utility",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "clips-machine",
    "name": "clips-machine",
    "description": "Transform long videos into viral short-form clips. Auto-detect best moments, add trendy captions, export for TikTok/Reels/Shorts.",
    "type": "media",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "healthcheck",
    "name": "healthcheck",
    "description": "Host security hardening and risk-tolerance configuration for OpenClaw deployments. Use when a user asks for security audits, firewall/SSH/update hardening, risk posture, exposure review, OpenClaw cron scheduling for periodic checks, or version status checks on a machine running OpenClaw (laptop, wor",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 1
  },
  {
    "id": "image-cog",
    "name": "image-cog",
    "description": "AI image generation powered by CellCog. Create images, edit photos, consistent characters, product photography, reference-based images, sets of images, style transfer. Professional image creation with AI.",
    "type": "design",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "postiz",
    "name": "postiz",
    "description": "Postiz is a tool to schedule social media and chat posts to 28+ channels X, LinkedIn, LinkedIn Page, Reddit, Instagram, Facebook Page, Threads, YouTube, Google My Business, TikTok, Pinterest, Dribbble, Discord, Slack, Kick, Twitch, Mastodon, Bluesky, Lemmy, Farcaster, Telegram, Nostr, VK, Medium, De",
    "type": "social",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "security-auditor",
    "name": "security-auditor",
    "description": "Use when reviewing code for security vulnerabilities, implementing authentication flows, auditing OWASP Top 10, configuring CORS/CSP headers, handling secrets, input validation, SQL injection prevention, XSS protection, or any security-related code review.",
    "type": "security",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "security-monitor",
    "name": "security-monitor",
    "description": "Real-time security monitoring for Clawdbot. Detects intrusions, unusual API calls, credential usage patterns, and alerts on breaches.",
    "type": "security",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "youtube-downloader-clipper",
    "name": "youtube-downloader-clipper",
    "description": "Extract specific sections from YouTube videos with precise timestamps. A powerful ClawHub skill that makes video clipping effortless - just provide a URL and time range.",
    "type": "media",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "youtube-transcript",
    "name": "youtube-transcript",
    "description": "Fetch and summarize YouTube video transcripts. Use when asked to summarize, transcribe, or extract content from YouTube videos. Handles transcript fetching via residential IP proxy to bypass YouTube's cloud IP blocks.",
    "type": "media",
    "source": "workspace",
    "usageCount": 1
  },
  {
    "id": "1password",
    "name": "1password",
    "description": "Set up and use 1Password CLI (op). Use when installing the CLI, enabling desktop app integration, signing in (single or multi-account), or reading/injecting/running secrets via op.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "ai-automation-workflows",
    "name": "ai-automation-workflows",
    "description": "Build automated AI workflows combining multiple models and services. Patterns: batch processing, scheduled tasks, event-driven pipelines, agent loops. Tools: inference.sh CLI, bash scripting, Python SDK, webhook integration. Use for: content automation, data processing, monitoring, scheduled generat",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "apple-notes",
    "name": "apple-notes",
    "description": "Manage Apple Notes via the `memo` CLI on macOS (create, view, edit, delete, search, move, and export notes). Use when a user asks OpenClaw to add a note, list notes, search notes, or manage note folders.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "apple-reminders",
    "name": "apple-reminders",
    "description": "Manage Apple Reminders via remindctl CLI (list, add, edit, complete, delete). Supports lists, date filters, and JSON/plain output.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "bear-notes",
    "name": "bear-notes",
    "description": "Create, search, and manage Bear notes via grizzly CLI.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "blogwatcher",
    "name": "blogwatcher",
    "description": "Monitor blogs and RSS/Atom feeds for updates using the blogwatcher CLI.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "blucli",
    "name": "blucli",
    "description": "BluOS CLI (blu) for discovery, playback, grouping, and volume.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "bluebubbles",
    "name": "bluebubbles",
    "description": "Use when you need to send or manage iMessages via BlueBubbles (recommended iMessage integration). Calls go through the generic message tool with channel=\"bluebubbles\".",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "camsnap",
    "name": "camsnap",
    "description": "Capture frames or clips from RTSP/ONVIF cameras.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "chirp",
    "name": "chirp",
    "description": "X/Twitter CLI using OpenClaw browser tool. Use when the user wants to interact with X/Twitter: reading timeline, posting tweets, liking, retweeting, replying, or searching. Alternative to bird CLI for environments without Homebrew.",
    "type": "social",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "clawdex",
    "name": "clawdex by Koi",
    "description": "Security check for ClawHub skills powered by Koi. Query the Clawdex API before installing any skill to verify it's safe.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "clawflows",
    "name": "clawflows",
    "description": "Search, install, and run multi-skill automations from clawflows.com. Combine multiple skills into powerful workflows with logic, conditions, and data flow between steps.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "cron-mastery",
    "name": "cron-mastery",
    "description": "Master OpenClaw's timing systems. Use for scheduling reliable reminders, setting up periodic maintenance (janitor jobs), and understanding when to use Cron vs Heartbeat for time-sensitive tasks.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "database",
    "name": "database",
    "description": "Database management and queries. Connect to SQL and NoSQL databases, run queries, and manage schemas.",
    "type": "database",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "discord",
    "name": "discord",
    "description": "Discord ops via the message tool (channel=discord).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "eightctl",
    "name": "eightctl",
    "description": "Control Eight Sleep pods (status, temperature, alarms, schedules).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "emergency-rate-limit",
    "name": "emergency-rate-limit",
    "description": "Instantly switch all agent models away from a rate-limited provider to a backup provider, then restore when limit lifts. Use when Anthropic or another provider is down or rate-limited. Trigger words: rate limit, provider down, anthropic down, emergency switch, model fallback, quota exceeded.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "gemini",
    "name": "gemini",
    "description": "Gemini CLI for one-shot Q&A, summaries, and generation.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "gh-issues",
    "name": "gh-issues",
    "description": "Fetch GitHub issues, spawn sub-agents to implement fixes and open PRs, then monitor and address PR review comments. Usage: /gh-issues [owner/repo] [--label bug] [--limit 5] [--milestone v1.0] [--assignee @me] [--fork user/repo] [--watch] [--interval 5] [--reviews-only] [--cron] [--dry-run] [--model ",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "gifgrep",
    "name": "gifgrep",
    "description": "Search GIF providers with CLI/TUI, download results, and extract stills/sheets.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "gog",
    "name": "gog",
    "description": "Google Workspace CLI for Gmail, Calendar, Drive, Contacts, Sheets, and Docs.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "himalaya",
    "name": "himalaya",
    "description": "CLI to manage emails via IMAP/SMTP. Use `himalaya` to list, read, write, reply, forward, search, and organize emails from the terminal. Supports multiple accounts and message composition with MML (MIME Meta Language).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "imsg",
    "name": "imsg",
    "description": "iMessage/SMS CLI for listing chats, history, and sending messages via Messages.app.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "kanban-deploy",
    "name": "kanban-deploy",
    "description": "Deploy tasks and changes to the Python Kanban Board at python-kanban.pages.dev. Covers editing tasks.json, git push, Cloudflare API deploy, and Playwright verification. Trigger words: kanban deploy, kanban board, deploy task, update kanban, python-kanban, task board.",
    "type": "deployment",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "linkedin",
    "name": "linkedin",
    "description": "LinkedIn automation via browser relay or cookies for messaging, profile viewing, and network actions.",
    "type": "social",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "mailgun",
    "name": "mailgun",
    "description": "Send emails via Mailgun API. Use when the user needs to send emails programmatically, such as newsletters, notifications, alerts, or automated reports. Requires MAILGUN_API_KEY and MAILGUN_DOMAIN environment variables to be configured.",
    "type": "communication",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "mcporter",
    "name": "mcporter",
    "description": "Use the mcporter CLI to list, configure, auth, and call MCP servers/tools directly (HTTP or stdio), including ad-hoc servers, config edits, and CLI/type generation.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "model-priority",
    "name": "model-priority",
    "description": "Manage AI model priorities and fallback chains across all cron jobs. Edit ONE config file to update all crons at once. Supports Kimi-K2.5, Gemini Flash, MiniMax with automatic fallback. Trigger words: model priority, switch model, fallback chain, kimi k2.5, gemini flash, minimax, update all crons, m",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "model-usage",
    "name": "model-usage",
    "description": "Use CodexBar CLI local cost usage to summarize per-model usage for Codex or Claude, including the current (most recent) model or a full model breakdown. Trigger when asked for model-level usage/cost data from codexbar, or when you need a scriptable per-model summary from codexbar cost JSON.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "nano-banana-pro",
    "name": "nano-banana-pro",
    "description": "Generate or edit images via Gemini 3 Pro Image (Nano Banana Pro).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "nano-pdf",
    "name": "nano-pdf",
    "description": "Edit PDFs with natural-language instructions using the nano-pdf CLI.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "obsidian",
    "name": "obsidian",
    "description": "Work with Obsidian vaults (plain Markdown notes) and automate via obsidian-cli.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "openai-image-gen",
    "name": "openai-image-gen",
    "description": "Batch-generate images via OpenAI Images API. Random prompt sampler + `index.html` gallery.",
    "type": "design",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "openai-whisper",
    "name": "openai-whisper",
    "description": "Local speech-to-text with the Whisper CLI (no API key).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "openai-whisper-api",
    "name": "openai-whisper-api",
    "description": "Transcribe audio via OpenAI Audio Transcriptions API (Whisper).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "openclaw-auto-updater",
    "name": "openclaw-auto-updater",
    "description": "Schedule automatic OpenClaw and skill updates with reliable cron templates, timezone-safe scheduling, and clear summary outputs. Use for hands-off maintenance, scheduled upgrades, and concise update reports.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "openclaw-sec",
    "name": "openclaw-sec",
    "description": "AI Agent Security Suite - Real-time protection against prompt injection, command injection, SSRF, path traversal, secrets exposure, and content policy violations",
    "type": "security",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "openclaw-social-scheduler",
    "name": "openclaw-social-scheduler",
    "description": "Built by AI, for AI. Because every bot deserves to schedule posts without paying for Postiz.",
    "type": "utility",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "openhue",
    "name": "openhue",
    "description": "Control Philips Hue lights and scenes via the OpenHue CLI.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "oracle",
    "name": "oracle",
    "description": "Best practices for using the oracle CLI (prompt + file bundling, engines, sessions, and file attachment patterns).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "ordercli",
    "name": "ordercli",
    "description": "Foodora-only CLI for checking past orders and active order status (Deliveroo WIP).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "peekaboo",
    "name": "peekaboo",
    "description": "Capture and automate macOS UI with the Peekaboo CLI.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "sag",
    "name": "sag",
    "description": "ElevenLabs text-to-speech with mac-style say UX.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "serpapi-location-search",
    "name": "serpapi-location-search",
    "description": "Perform location-based searches using Google Search API via SerpApi. Use this skill when you need to find businesses, places, or services in a specific geographic area (e.g., \"pizza places in Phoenix\", \"coffee shops near me\", \"restaurants in Cave Creek AZ\").",
    "type": "search",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "session-logs",
    "name": "session-logs",
    "description": "Search and analyze your own session logs (older/parent conversations) using jq.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "sherpa-onnx-tts",
    "name": "sherpa-onnx-tts",
    "description": "Local text-to-speech via sherpa-onnx (offline, no cloud)",
    "type": "social",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "slack",
    "name": "slack",
    "description": "Use when you need to control Slack from OpenClaw via the slack tool, including reacting to messages or pinning/unpinning items in Slack channels or DMs.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "songsee",
    "name": "songsee",
    "description": "Generate spectrograms and feature-panel visualizations from audio with the songsee CLI.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "sonoscli",
    "name": "sonoscli",
    "description": "Control Sonos speakers (discover/status/play/volume/group).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "spotify-player",
    "name": "spotify-player",
    "description": "Terminal Spotify playback/search via spogo (preferred) or spotify_player.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "summarize",
    "name": "summarize",
    "description": "Summarize or extract text/transcripts from URLs, podcasts, and local files (great fallback for “transcribe this YouTube/video”).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "things-mac",
    "name": "things-mac",
    "description": "Manage Things 3 via the `things` CLI on macOS (add/update projects+todos via URL scheme; read/search/list from the local Things database). Use when a user asks OpenClaw to add a task to Things, list inbox/today/upcoming, search tasks, or inspect projects/areas/tags.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "trello",
    "name": "trello",
    "description": "Manage Trello boards, lists, and cards via the Trello REST API.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "twitter",
    "name": "twitter",
    "description": "Twitter/X platform integration. Post tweets, read timeline, manage followers, and analyze engagement.",
    "type": "social",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "video-agent",
    "name": "video-agent",
    "description": "Generate AI avatar videos with HeyGen's Video Agent API. One-shot prompt to video generation.",
    "type": "agent",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "video-frames",
    "name": "video-frames",
    "description": "Extract frames or short clips from videos using ffmpeg.",
    "type": "media",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "voice-call",
    "name": "voice-call",
    "description": "Start voice calls via the OpenClaw voice-call plugin.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "wacli",
    "name": "wacli",
    "description": "Send WhatsApp messages to other people or search/sync WhatsApp history via the wacli CLI (not for normal user chats).",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  },
  {
    "id": "x-publisher",
    "name": "X-Publisher",
    "description": "Publish tweets to X (Twitter) using the official Tweepy library. Supports text-only tweets, tweets with images or videos, and returns detailed publish results including tweet ID and URL. Requires X API credentials (API Key, API Secret, Access Token, Access Token Secret).",
    "type": "social",
    "source": "workspace",
    "usageCount": 0
  },
  {
    "id": "xurl",
    "name": "xurl",
    "description": "A CLI tool for making authenticated requests to the X (Twitter) API. Use this skill when you need to post tweets, reply, quote, search, read posts, manage followers, send DMs, upload media, or interact with any X API v2 endpoint.",
    "type": "utility",
    "source": "openclaw",
    "usageCount": 0
  }
]